app/controllers/cars_controller.rb

INSERT INTO "cars" ("producer", "model", "color", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["producer", "efds"], ["model", "fsdf"], ["color", "fdsf"], ["price", 11], ["created_at", 2016-12-17 11:59:07 UTC], ["updated_at", 2016-12-17 11:59:07 UTC]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "producer" = $1, "model" = $2, "color" = $3, "price" = $4, "updated_at" = $5 WHERE "cars"."id" = $6  [["producer", "mss"], ["model", "dsdsasa"], ["color", "dsdsas"], ["price", 11122], ["updated_at", 2016-12-17 15:24:33 UTC], ["id", 15]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)